<template>
    <div>
      <div class="margin">
        <div class="title">
          <p>{{appName}}服务条款</p>
        </div>
        <div class="normalContent">
          <p>
            {{company}}非常重视您的个人信息保护，并会尽全力保护您的个人信息。您使用{{ appName }}，后台管理系统的服务时，我们将按照《{{appName}}用户隐私声明》（以下简称“本协议”）收集、使用您的个人信息。我们建议您完整地阅读本协议，以帮助您了解维护自己的隐私权。如果您不同意本协议的任何内容，您应立即停止使用该软件产品或服务。当您使用该软件提供的任何服务时，即表示您已同意我们按照本协议来合法地使用和保护您的个人信息。
            如果您有任何疑问、意见或建议，请通过以下方式与我们联系：<br>
            电话：{{ phone }}<br>
            邮箱：{{email}}<br>
          </p>
        </div>
        <div class="normalContent">
          <p>本协议包含以下内容：</p>
          <p class="normalContent2">
            一、重要须知<br>
            二、服务内容<br>
            三、用户使用规则<br>
            四、知识产权<br>
            五、服务变更、中断或终止<br>
            六、其他事宜
          </p>
        </div>

        <div class="divLine"></div>
        <div class="boldContent">
          <p>一、重要须知</p>
        </div>
        <div class="normalContent">
          <p>1、本协议适用于该软件所提供的所有服务，涵盖范围包括您访问的{{ appName }}App和{{appName}}后台管理系统Web，均适用本协议;</p>
        </div>
        <div class="normalContent">
          <p>2、用户在进行注册程序过程中点击“同意”按钮即表示用户完全接受本协议项下的全部条款;</p>
        </div>
        <div class="normalContent">
          <p>3、用户注册成功后, 该软件将给予每个用户一个用户账号及相应的密码，该用户账号和密码由用户负责保管;
            用户须妥善保管账号和密码，防止泄露，如果账号和密码被盗用的，用户应当对因其账号或密码丢失所造成的在其账号所发生的一切后果和所有活动及事件负法律责任。</p>
        </div>
        <div class="boldContent">
          <p>二、服务内容</p>
        </div>
        <div class="normalContent">
          <p>1、该软件产品的具体服务内容由我们根据实际情况提供，例如客户管理、客户检索、人脸识别、个人使用信息、使用事件、推送消息等。</p>
        </div>
        <div class="normalContent">
          <p>2、该软件提供的部分服务超出基础服务的内容为收费VIP服务，用户使用收费服务时需要向本公司支付一定的费用。对于收费服务，该软件会在用户使用之前给予用户明确的提示，只有用户根据提示确认其愿意支付相关费用并完成付费，用户才能使用该等收费服务。如用户拒绝支付相关费用，则该软件有权不向用户提供该等收费服务。</p>
        </div>
        <div class="normalContent">
          <p>3、用户理解，该软件仅提供软件内容的相关服务，除此之外与使用该软件服务有关的设备（如手机、个人电脑及其他与接入互联网或移动网有关的装置）、网络服务、或产品以及伴随发生的所需费用（如为接入互联网而支付的电话费及上网费、为使用移动网而支付的手机费）均应由用户自行负担。</p>
        </div>
        <div class="normalContent">
          <p>4、用户同意该软件为本协议履行或相关研究的目的收集、使用或授权第三方（且该等第三方同意承担与本协议同等的个人信息保护义务）非商业地使用通过服务获取的用户信息（包括但不限于身份信息、性别、年龄、面部信息在该软件中形成的录音等语音资料），包括但不限于使该软件及其他用户可以查看用户的头像、名字、语音等个人资料、应用于相关学术、应用研究等。本协议承诺，除非另行取得用户的事先同意，否则该软件不会将用户信息授权给与履行本协议无关的第三方用于商业目的。</p>
        </div>
        <div class="normalContent">
          <p>5、根据相关法律法规及国家相关部门的要求，在以下情形中，该软件可能会依法收集并使用用户的个人信息并且无需征得用户的同意：
            <p class="normalContent2">
              （1）与国家安全、国防安全直接相关的；<br>
              （2）与公共安全、公共卫生、重大公共利益直接相关的；<br>
              （3）与犯罪侦查、起诉、审判和判决执行等直接相关的；<br>
              （4）出于维护用户或他人的生命、财产等重大合法权益但又很难得到用户本人同意的；<br>
              （5）所收集的个人信息是用户自行向社会公众公开的；<br>
              （6）从合法公开披露的信息中收集个人信息，例如：合法的新闻报道、政府信息公开等渠道；<br>
              （7）根据用户的要求签订和履行合同所必需的；<br>
              （8）用于维护所提供的该软件服务的安全稳定运行所必需的，例如：发现、处置产品或服务的故障；<br>
              （9）为合法的新闻报道所必需的；<br>
              （10）学术研究机构基于公共利益开展统计或学术研究所必要，且对外提供学术研究或描述的结果时，对结果中所包含的个人信息进行去标识化处理的；<br>
              （11）法律法规规定的其他情形。
            </p>
          </p>
        </div>
        <div class="normalContent">
          <p>6、在以下情形中，该软件向第三方提供用户的个人信息无需事先征得用户的授权同意：
            <p class="normalContent2">
              （1）与国家安全、国防安全有关的；<br>
              （2）与公共安全、公共卫生、重大公共利益有关的；<br>
              （3）与犯罪侦查、起诉、审判和判决执行等有关的；<br>
              （4）出于维护用户或其他个人的生命、财产等重大合法权益但又很难得到本人同意的；<br>
              （5）用户自行向社会公众公开的个人信息；<br>
              （6）从合法公开披露的信息中收集个人信息的，如合法的新闻报道、政府信息公开等渠道。
            </p>
            根据法律规定，向第三方提供经去标识化处理的个人信息，且确保数据接收方无法复原并重新识别个人信息主体的，不属于个人信息的对外共享、转让及公开披露行为，对此类数据的保存及处理将无需另行向用户通知并征得用户的同意。
          </p>
        </div>
        <div class="normalContent">
          <p>本协议中涉及该软件对于用户提供的个人信息的使用，如与《隐私声明》不符的，以《隐私声明》为准。</p>
        </div>

        <div class="boldContent">
          <p>三、用户使用规则</p>
        </div>
        <div class="normalContent">
          <p>1、用户注册成功后，用户有权使用该软件的功能和服务与其他用户、第三方个体进行分享交流，包括课程学习、分享教学、报告数据以及分享其他一切用户感兴趣的内容；</p>
        </div>
        <div class="normalContent">
          <p>2、用户有权使用该软件提供的个人主页、上传照片、分享个人信息；</p>
        </div>
        <div class="normalContent">
          <p>3、用户在使用该软件时须遵守国家相关法律法规，内容不得包含有下列内容之一的信息：
            <p class="normalContent2">
              a）反对宪法所确定的基本原则的；<br>
              b）危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的；<br>
              c）损害国家荣誉和利益的；<br>
              d）煽动民族仇恨、民族歧视、破坏民族团结的；<br>
              e）破坏国家宗教政策，宣扬邪教和封建迷信的；<br>
              f）散布谣言，扰乱社会秩序，破坏社会稳定的；<br>
              g）散布淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪的；<br>
              h）侮辱或者诽谤他人，侵害他人合法权利的；<br>
              i）含有虚假、有害、胁迫、侵害他人隐私，或骚扰、侵害、中伤、粗俗、猥亵、或其它道德上令人反感的内容；<br>
              j）含有中国法律、法规、规章、条例以及任何具有法律效力之规范所限制或禁止的其它内容的；<br>
              k）含有该软件所有者认为不利于该软件运营的内容；
              l) 没有明确取得客户同意上传客户人脸信息的；<br>
            </p>
          </p>
        </div>
        <div class="normalContent">
          <p>4、用户必须清楚使用规则，该软件仅供个人交流、学习共享，非商业性质的使用，用户不可利用该软件产品本身或其信息或其内容等知识产权内容进行出售、或利用本服务进行调查、广告、或用于其他商业目的。</p>
        </div>
        <div class="normalContent">
          <p>5、用户保证在使用该软件时发布、传播的信息所具有的真实性、准确性，保证不得发布违法违规信息、谣言或其他与事实不符引起他人不适的言论、信息；</p>
        </div>
        <div class="normalContent">
          <p>6、用户保证在使用该软件时不得发布、传播侵犯知识产权或其他合法权益的信息。用户传播内容中涉及第三方拥有知识产权内容的相关授权或其他内容的合法性由用户自行负责，该软件对相关内容的知识产权权属或是否侵犯他人民事权益等情况不进行审查或监督，但有权将按相关法规对涉嫌侵权的内容履行删除、关闭账号或断开链接等处置。</p>
        </div>
        <div class="normalContent">
          <p>7、若用户发生前述3-6的行为时，由用户承担所有的违法、违规或侵权责任，若因此给该软件造成任何损失，该软件有权向责任用户主张相关责任。同时，该软件所有者有权对违法、侵权、违规的用户终止提供服务。如果政府或者司法机关要求该软件所有者告知进行侵权行为用户的具体信息的，该软件有权根据现行法规向其告知用户信息。</p>
        </div>
        <div class="normalContent">
          <p>8、用户同意该软件有权在提供服务过程中以各种方式投放各种商业性广告或其他任何类型的商业信息，并且，用户同意接受该软件通过电子邮件或其他方式向用户发送产品促销或其他相关商业信息。</p>
        </div>
        <div class="divLine"></div>
        <div class="boldContent">
          <p>四、知识产权</p>
        </div>
        <div class="normalContent">
          <p>1、用户在使用该软件分享个人学习记录或者演绎他人学习记录时，不得侵犯第三方任何知识产权。</p>
        </div>
        <div class="normalContent">
          <p>2、用户使用该软件分享信息中含有的完全由用户自身原创的信息其版权归用户，但其中利用该软件而形成的录音或其他资料，利用该软件中已有的素材、信息或内容而形成的录音或其他资料的版权由用户与该软件所有者共有。用户的分享行为是对其享有版权或经合法授权的相关内容的网络传播行为的许可，用户的分享行为即表明其已授权该软件及其他用户有权复制、传播前述信息。</p>
        </div>

        <div class="boldContent">
          <p>五、服务变更、中断或终止</p> </div>
        <div class="normalContent">
          <p>1、鉴于软件服务的特殊性，用户同意该软件有权随时变更、中断或终止部分或全部的服务（包括收费服务及免费服务）。如变更、中断或终止的服务属于免费服务，该软件无需通知用户，也无需对任何用户或任何第三方承担任何责任；如变更、中断或终止的服务属于收费服务，则该软件应当在变更、中断或终止之前事先通知用户，并应向受影响的用户提供等值的替代性的收费服务，如用户不愿意接受替代性的收费服务，就该用户已经向该软件支付的服务费，该软件应当按照该用户实际使用相应收费服务的情况扣除相应服务费、使用费之后将剩余的服务费退还给该用户。</p>
        </div>
        <div class="normalContent">
          <p>2、用户理解，该软件需要定期或不定期地对提供服务的平台或相关的设备进行检修或者维护，如因此类情况而造成收费服务在合理时间内的中断，该软件无需为此承担任何责任，但该软件应尽可能事先进行通告。</p>
        </div>
        <div class="normalContent">
          <p>3、如发生下列任何一种情形，该软件有权随时中断或终止向用户提供本协议项下的服务：
            <p class="normalContent2">
              a）用户提供的个人资料不真实；<br>
              b）用户违反本协议中规定的使用规则；<br>
              c）用户在使用收费服务时未按规定向该软件支付相应的服务费；<br>
              d）出现自然灾害等不可抗力导致该软件无法运营。
            </p>
          </p>
        </div>
        <div class="normalContent">
          <p>4、用户注册的免费账号昵称如存在违反法律法规、国家政策要求、该软件的昵称管理要求，或侵犯任何第三方合法权益的情况，该软件有权要求用户进行修改或收回该账号昵称。</p>
        </div>
        <div class="boldContent">
          <p>六、其他事宜</p>
        </div>
        <div class="normalContent">
          <p>1、该软件有权根据法律法规的变化、网站更新以及相应的该软件运营的需要不时地对本协议及本站的内容进行修改，并在网站以及该软件的规范位置张贴。修改后的协议一旦被张贴在该软件上即刻生效，并代替原来的协议，用户可随时登录查阅最新协议。用户有义务及时关注并阅读最新版的本协议及公告。如用户不同意更新后的协议，可以立即向该软件客户服务进行反馈且应立即停止接受该软件依据本协议提供的服务；如用户继续使用该软件提供的服务的，即视为同意更新后的协议。</p>
        </div>
        <div class="normalContent">
          <p>2、本协议自用户点击“同意”、“接受”后生效。</p>
        </div>
        <div class="normalContent">
          <p>3、本协议所有条款的标题仅为方便而设，不具法律或契约效果。</p>
        </div>
        <div class="normalContent">
          <p>4、本协议的解释权归{{company}}所有。</p>
        </div>
      </div>
    </div>
</template>

<script>
export default {
  name: 'UserService',
  data() {
    return {
      name: '倪先生',
      appName: '《人脸客户宝》',
      company: 'NYS工作室',
      phone: '+86 188-53936-222',
      email: 'niyongsheng@outlook.com',
      address: '山东省临沂市兰山区',
      updateTime: '2022年-06月-07日'
    }
  }
}
</script>

<style scoped>
.margin {
  margin: 30px 10px;
  line-height: 18px;
}

.footer {
  margin: 25px 0;
}

.title {
  width: 100%;
  padding: 40px 0px;
  font-size: large;
  p-align: center;
  font-weight: bold;
}

.boldContent {
  width: 100%;
  padding-bottom: 5px;
  padding-top: 5px;
  font-weight: bolder;
  font-size: small;
}

.divLine {
  width: 100%;
  height: 1px;
}

.normalContent {
  p-indent: 10px;
  p-align: left;
  width: 100%;
  font-size: small;
  padding-bottom: 5px;
  padding-top: 5px;
}

.normalContent2 {
  p-indent: 0px;
  p-align: left;
  width: 100%;
  font-size: small;
  padding-bottom: 5px;
  padding-top: 5px;
  display: block;
  margin-left: 10px;
}
</style>
